SeongMin1000/Embedded_System/micro_os/NUCLEO-f429zi_example_code (updated)/Examples/ST/STM32F429II-SK/OS3/app.c
  flags = OSFlagPend(&AlarmFlagGroup,
                     ALARM_FLAG_JOYSTICK_START,
                     0,
                     OS_OPT_PEND_FLAG_SET_ANY | OS_OPT_PEND_FLAG_CONSUME | OS_OPT_PEND_BLOCKING,
                     0,
                     &err);

  uint16_t joystickX, joystickY;
  char buffer[200];
  buffer[0] = '\0'; // 문자열 초기화

  strcat(buffer, "조이스틱 모듈을 ");

  int required_joy = Joystick_missions[random_index];

  int left = 0;
  int right = 0;
  int up = 0;
  int down = 0;
  int center = 0;

  for (int i = 0; i < 3; i++)
  {
    if (Joystick_missions[required_joy][i] == 1)
    {
      left += 1;
      strcat(buffer, "왼쪽 ");
    }
    else if (Joystick_missions[required_joy][i] == 2)
    {
      right += 1;
      strcat(buffer, "오른쪽 ");
    }
    else if (Joystick_missions[required_joy][i] == 3)
    {
      up += 1;
      strcat(buffer, "위쪽 ");
    }
    else
    {
      down += 1;
      strcat(buffer, "아래쪽 ");
    }
  }

  strcat(buffer, "방향으로 움직여주세요\r\n");
  OSQPost(&USARTMsgQ, (void *)buffer, sizeof(buffer), OS_OPT_POST_FIFO, &err);
  uint16_t prevX = 0, prevY = 0;

  while (1)
  {
    joystickX = JoyStick_ReadX();
    joystickY = JoyStick_ReadY();

    if ((joystickX * 7 > 300 && joystickX * 7 < 600) &&
        (joystickY > 1000 && joystickY < 3000))
    {
      break; // 중앙 위치에서만 탈출
    }

    OSTimeDlyHMSM(0, 0, 0, 100, OS_OPT_TIME_HMSM_STRICT, &err);
  }

  while (1)
  {
    joystickX = JoyStick_ReadX();
    joystickY = JoyStick_ReadY();

    // 중앙 위치일 경우: 상태 초기화 및 남은 방향 안내
    if ((joystickX * 7 > 300 && joystickX * 7 < 600) &&
        (joystickY > 1000 && joystickY < 3000))
    {
      prevX = joystickX;
      prevY = joystickY;

      OSTimeDlyHMSM(0, 0, 0, 300, OS_OPT_TIME_HMSM_STRICT, &err);
      continue;
    }

    // 오른쪽
    if (joystickX * 7 > 1000 && prevX * 7 <= 1000)
    {
      right--;
      if (right < 0)
      {
        right = 0;
      }
      USART_SendString("오른쪽 입력\r\n");
    }

    // 왼쪽
    else if (joystickX * 7 < 100 && prevX * 7 >= 100)
    {
      left--;
      if (left < 0)
      {
        left = 0;
      }
      USART_SendString("왼쪽 입력\r\n");
    }

    // 위
    else if (joystickY > 3000 && prevY <= 3000)
    {
      up--;
      if (up < 0)
      {
        up = 0;
      }
      USART_SendString("위쪽 입력\r\n");
    }

    // 아래
    else if (joystickY < 1000 && prevY >= 1000)
    {
      down--;
      if (down < 0)
      {
        down = 0;
      }
      USART_SendString("아래쪽 입력\r\n");
    }

    prevX = joystickX;
    prevY = joystickY;

    if (left == 0 && right == 0 && up == 0 && down == 0)
    {
      OSFlagPost(&AlarmFlagGroup, ALARM_FLAG_OFF, OS_OPT_POST_FLAG_SET, &err);
      break;
    }

    OSTimeDlyHMSM(0, 0, 0, 100, OS_OPT_TIME_HMSM_STRICT, &err);
  }
}

// USART Task
static void USARTTask(void *p_arg)
{
  OS_ERR err;
  void *msg;
  OS_MSG_SIZE size;

  (void)p_arg;

  while (DEF_TRUE)
  {
    // 메시지 큐에서 문자열 수신 (blocking)
    msg = OSQPend(&USARTMsgQ,
                  0,
                  OS_OPT_PEND_BLOCKING,
                  &size,
                  0,
                  &err);

    if (err == OS_ERR_NONE && msg != NULL)
    {
      // 문자열 출력
      USART_SendString((char *)msg);
    }
  }
}
